"" + 1 + 0 // 010. სტრინგ სიცარიელე არის false, false კი არის 0, შესაბამისად გაერთიანდებიან. ხოლო რადგან სტრინგთან ხდება მიმატება ციფრი იქნება სტრინგი.
// მაგრამ აქაც 10_ია პასუხი და ვერ გავიგე. სად არის კონკატენაცია?! :დ
"" - 1 + 0 // -1. მინუსის დროს ჩვეულებრივად ხდება მათემატიკური ოპერაცია თუ სტრინგი შეესაბამება რიცხვს ხოლო +0 სტრინგი არ არის რომ გაერთიანება მოხდეს.
true + false // 1. true ნიშნავს რაიმეს ანუ 1 ხოლო false 0 არაფერს, შესაბამისად დაჯამებით მიიღება.
6 / "3" // 2. ნამბერის და სტრინგის გაყოფით რომელიც არის რიცხვი 3 შესაძლებელია მათემატიკური გამოთვლა.
"2" * "3" // 6. მიუხედავად იმისა რომ სტრინგია ჯავასკრიპტში ავტომატურად ხდება გამრავლება, თუ სტრინგი შეესაბამება ციფრს.
4 + 5 + "px" // 9px. ნამბერებში მოხდა გამოთვლა ხოლო სტრინგი გაერთიანდა შემდეგ.
"$" + 4 + 5 // $45. სტრინგს მიემატა ნამბერი და მოხდა გაერთიანება და გამოვიდა "$4" სტრინგში ხოლო ამას კიდევ რომ დავუმატოთ 5 მივიღებთ ზემოხსენებულ პასუხს.
'4' - 2 // 2. სტრინგი რადგან არის ნამბერი ავტომატურად მოახდენს გამოთვლას.
"4px" - 2 // NaN. მართალია 4 რიცხვია მაგრამ მას ასევე აქვს px ეს კი გაერთიანებულია სტრინგში 4-თან. მათემატიკური გამოთვლა ვერ მოხერხდება.
7 / 0 // infinity. რადგან ნოლზე იყოფა რიცხვი.
' -9 ' + 5 // " -9 5". აქაც გაერთიანება მოხდება.
" -9 " - 5 // -14. ჩვეულებრივად შესრულდება გამოთვლა.
null + 1 // 1. null ნიშნავს სიცარიელეს 0.
undefined + 1 // NaN. რადგან მას არ გააჩნია არანაირი მნიშვნელობა და ნებისმიერი გამოთვლა ანულირებული იქნება.