let name = "Dan";
alert(
  `hello ${name + 1}`
); /* string: hello NaN. რადგან ცვლადის მნიშვნელობა არის Dan, შესაბამისად სიტყვებზე(ასოებზე) მათემატიკური ოპერაცია ვერ
 განხორციელდება.*/
/* მაგრამ გიო კონსოლ ლოგში მერე ვნახე რომ ამის მნიშვნელობა არის hello dan1 და რატომ? ეს აპოსტროპი გასაგებია გაერთიანებას აღნიშნავს 
მაგრამ თვითონ {name + 1}-ში ხომ გამოთვლა ხდება, dan ხომ არ არის რიცხვი, და თუ რიცხვი არ არის ესეიგი გაერთიანებას აკეთებს?*/
alert(`hello ${"name"}`); // string: hello name. რადგან თვითონ სტრინგია უკვე name, ბრჭყალებშია მოცემული და არ არის ჩასმული ცვლადი.
alert("hello ${name}"); // string: hello ${name}. აქ უბრალოდ ერთი მთლიანი სტრინგია მოცემული.
alert(
  'hello ${"name"}'
); /* string: hello ${"name"}. აქაც ერთი მთლიანი სტრინგია მოცემული შესაბამისად დაკოპირდება ყველაფერი მიუხედავად იმისა
რომ name ცალკე სტრინგშია*/
